==================
Grpcurl command
==================

grpcurl

---

(grpcurl)

==================
Proto flag
==================

grpcurl -proto file/path/here.proto

---

(grpcurl
  (flag
    (proto
      (path))))

==================
Plaintext flag
==================

grpcurl -plaintext

---

(grpcurl
  (flag
    (plaintext)))

==================
Address only
==================

grpcurl localhost:50051

---

(grpcurl
  (address))

==================
Address with a single flag
==================

grpcurl -plaintext localhost:50051

---

(grpcurl
  (flag
    (plaintext))
  (address)
)

==================
Describe
==================

grpcurl -plaintext describe

---

(grpcurl
  (flag
    (plaintext))
  (describe)
)

==================
List
==================

grpcurl -plaintext list

---

(grpcurl
  (flag
    (plaintext))
  (list)
)

==================
Complicated
==================

grpcurl -plaintext -proto file/path/here.proto localhost:50051 list service/ServiceName

---

(grpcurl
  (flag
    (plaintext))
  (flag
    (proto
        (path)))
  (address)
  (list)
  (symbol)
)

