==================
Line comment test
==================

// Some line comment text content

---

(source_file
  (line_comment
    (line_comment_text)))

==================
Block comment test
==================

/* Some comment text content */

---

(source_file
  (block_comment
    (comment_text)))

==================
Grpcurl command
==================

grpcurl

---

(source_file
  (grpcurl
    (command)))

==================
Proto flag
==================

grpcurl -proto file/path/here.proto

---

(source_file
  (grpcurl
    (command
      (flag
        (proto
          (path))))))

==================
Plaintext flag
==================

grpcurl -plaintext

---

(source_file
  (grpcurl
    (command
      (flag
        (plaintext)))))

==================
Address only
==================

grpcurl localhost:50051

---

(source_file
  (grpcurl
    (command
      (address))))

==================
Address with a single flag
==================

grpcurl -plaintext localhost:50051

---

(source_file
  (grpcurl
    (command
      (flag
        (plaintext))
      (address)
    )))

==================
Describe
==================

grpcurl -plaintext describe

---

(source_file
  (grpcurl
    (command
      (flag
        (plaintext))
      (describe)
    )))

==================
List
==================

grpcurl -plaintext list

---

(source_file
  (grpcurl
    (command
      (flag
        (plaintext))
      (list)
    )))

==================
Json data
==================

grpcurl -plaintext some/Symbol
{
  "property1": "value1"
}

---

(source_file
  (grpcurl
    (command
      (flag
        (plaintext))
      (symbol)))
  (data))

==================
Complicated
==================

grpcurl -plaintext -proto file/path/here.proto localhost:50051 list service/ServiceName

---

(source_file
  (grpcurl
    (command
      (flag
        (plaintext))
      (flag
        (proto
            (path)))
      (address)
      (list)
      (symbol)
    )))

